---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientInterpolation
source: html/ddc59dac-e0ac-6455-34ee-049280929d1b.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientInterpolation Property

The property labeled "Interpolation" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientInterpolation { get; }
```

## Remarks
This property is a "AssetPropertyList" of type "AssetPropertyInteger".